[
    {
        "name": "Cause and Effect Implied",
        "definition": "The therapist makes a statement that implies that one thing causes another, or states that one thing is true, therefore the next thing must be true. The statement may be untrue, or there may be no direct link between the one thing and the other.",
        "examples": [
            "And knowing that you can stop gives you the right to change.",
            "Snapping that tape means you are choosing a different life",
            "You don't need to smoke any more because so many people love you and need you ",
        ],
    },
    {
        "name": "Complex Equivalence",
        "definition": "This is where a Milton Model suggestion is given that one thing is the same as or equivalent to some other thing. It isn't that one thing causes another, but the implication that because one thing is true the other thing must be true.",
        "examples": [
            "Seeing yourself on that bridge demonstrates that you have made a decision today",
            "Snapping that tape means you are choosing a different life",
            "because you have control... you have choice in everything you do... ",
        ],
    },
    {
        "name": "Conversational Postulate",
        "definition": "A conversational postulate is a question which, on the face of it, requires a Yes or No answer, but which is really demanding a specific behavior. 'Could you pass me the cream?' is a request for action, not an enquiry about ability. 'Do you really have to stand there?' is a request for someone to move. Similarly, questions can be posed in hypnosis that are really instructions.",
        "examples": [
            "I wonder if you can recall a time when you were really relaxed?",
            "Can you imagine some peaceful, restful place?",
            "I wonder if you could imagine a big old house somewhere....?",
            "Could you begin to relax while counting backwards from ten?",
        ],
    },
    {
        "name": "Embedded Commands",
        "definition": "Direct commands can be embedded within ordinary conversation. This is the essence of a conversational induction, or covert hypnosis induction. ",
        "examples": [
            "I can see that you are comfortable lying there, relaxing in that chair, quietly confident, looking so comfortable as if you are ready to just let things go and relax while I talk about this and that and you know, you don't have to think, you don't have to listen to me or do anything really except relax and allow you mind to drift away like a small child snuggling comfortably down in a warm quiet place, slowing down, more at ease and more relaxed...",
        ],
    },
    {
        "name": "Extended Quotation",
        "definition": "If you attribute a suggestion to someone else this can avoid a lot of resistance from the client. By using one or more levels of quotation you can say almost anything to the client, and will probably confuse the unconscious mind in the process, making the suggestion more likely to be accepted.",
        "examples": [
            "Milton Erickson once told the story about how he told a man 'you can learn to relax instantly' and the man found he could relax immediately and said \"you know 'Everyone can relax faster than they think.'\"",
            "I met a man from Bombay who said the secret of confidence is 'Fake it till you make it'.",
            "And as you circulate around that party you overhear someone saying 'I am so proud of her. She is best daughter I could ever have wished for. She has become everything hoped for.' And the other person replies 'Yes, maybe we didn't say it often enough, maybe we thought she would just know it'.",
        ],
    },
    {
        "name": "Lost Performative",
        "definition": "A suggestion is presented to the subconscious stating that some opinion is true, but does not say how it known to be true, or who is saying it. The therapist intends that the subconscious will accept the statement as being self evident and not ask for proof. ",
        "examples": [
            "Your subconscious mind will find the correct answer.",
            "You are never going to have a problem with your nails again.",
            "No habit can stand up to the power of the mind.",
        ],
    },
    {
        "name": "Mind Reading",
        "definition": "The Milton Model designs the suggestion as if knowing what the client is thinking or feeling, when the reality is that the therapist has no way of knowing what the client is thinking.",
        "examples": [
            "Part of your mind is wondering how fast you are going into trance right now...",
            "You are becoming more curious about how that change is occurring",
            "Your mind is now becoming more open to the idea of change...",
        ],
    },
    {
        "name": "Modal Operator",
        "definition": "These are phrases that use words that imply things could happen or must happen. Typical Milton Model operators include words such as 'can, should, must, might, could, would, will'. Modal operators might be the most commonly used hypnotic form.",
        "examples": [
            "And each gentle breath out can lead to more relaxation.",
            "And you could be surprised at how quickly you go into trance.",
            "you might notice your left hand getting heavy....'",
        ],
    },
    {
        "name": "Negative Suggestions",
        "definition": "Negative suggestions are similar to conversational postulates in that they ask for one thing but really expect a different behaviour. The Milton Model works because the unconscious mind does not deal with negatives well, and tends to ignore the words 'don't and not' and instead focuses on the object of the sentence. The sentence 'Don't think of a kangaroo' must bring out a memory of a kangaroo before it can be not thought of, so negative questions can be used to give positive commands.",
        "examples": [
            "and I don't want you to feel that you are going into trance now",
            "you should not be too curious about how you feel yourself going into trance.",
            "You don't have to think about a really relaxing experience to call it to mind again",
        ],
    },
    {
        "name": "Nominalizations",
        "definition": "The Milton Model is all about using words in an 'artfully vague' way. A nominalisation is a word formed from a process. For example the verb 'to restrict' can be nominalised into the noun 'restriction'. The word restriction is then treated as if it is a 'thing' and the fact that it refers to a ongoing process is forgotten. By using the nominalisation the thing is treated as if it is over and done with, when in fact the process may still be going on. Nouns ending in '-ship', '-ment', '-ion' or '-ings' are often nominalisations, for example 'relationship', 'annulment', 'learnings', 'decision'. By treating the word as a noun, the fact that you are asking the person to go through a process is hidden.",
        "examples": [
            "Your relaxation is increasing as you listen to my voice ",
            "By moving your finger your confirm your irrevocable decision.",
            "...you may wonder which part of your achievement you will enjoy most",
        ],
    },
    {
        "name": "Non Sequitur",
        "definition": "A Milton Model non sequitur is a statement presented in the form of 'cause leads to effect', A > B, but where there is in fact no logical connection between A and B. The structure of the statement fools the listener by starting with a statement of something that is true and then specifying an outcome that does not logically follow. Getting the client to focus on their breathing has nothing to do with relaxation, but by stating something that is true, that they are focusing on their breathing, the mind is distracted into accepting the second part, that they can relax, without examining the causal link between them.",
        "examples": [
            "... paying attention to your breathing can make you relax even more. ",
            "You will be returning to the present, and bringing with you everything have learned today.",
            "as I count down the steps you will go deeper into trance",
        ],
    },
    {
        "name": "Presuppositions",
        "definition": "A Milton Model presupposition talks about the consequences of something and deliberately avoids mentioning the underlying concept. The suggestion starts from an assumption that thing is true and then discusses the consequences of that thing being true. By focusing on the consequences whether the thing is true or not is ignored and never tested.",
        "examples": [
            "And now as you relax more deeply you feel something different.",
            "I don't know whether you will go into hypnosis before relaxation is fully completed or begin right away.",
            "The little things you notice remind you of how you have relaxed.",
            "Because your eyes are closed, your mind will open to the idea of deep relaxation.",
            "Coming here today means you have made a decision to relax.",
            "It may not be until the third breath that you notice relaxing.",
            "And you may find that each breath relaxes you more.",
            "You may not feel you are at the right level of relaxation yet.",
            "It might be interesting to consider the level of your relaxation.",
        ],
    },
    {
        "name": "Inanimations",
        "definition": "These are Milton Model statements that assign feelings or actions to things that cannot have any. Technically these are called Selectional Restriction Violations. A sofa cannot think, a plant cannot talk, but sentences can be constructed that sound that way and because our minds are specially tuned to metaphor, this type of suggestion will be accepted by the unconscious.",
        "examples": [
            "That chair knows the secrets of many clients",
            "The part of you that makes you smoke is ashamed and wants to change",
            "Listen to the wind in the trees and absorb its wisdom",
        ],
    },
    {
        "name": "Tag Question",
        "definition": "These are Milton Model questions that encourage the client to confirm the truth of the words immediately preceding, aren't they? If you read that question again, its almost impossible not to say 'Yes', isn't it? It's always good to get the client into a positive frame of mind, I'm sure you would agree? If the tag question is delivered with a descending tone of voice, it reinforces the statement and discourages dissension.",
        "examples": [
            "Relaxing can be very enjoyable, isn't it?",
            "Some people really enjoy relaxing, don't you? ",
            "You might wonder what you will enjoy most, won't you? ",
        ],
    },
    {
        "name": "Truism sets",
        "definition": "A Truism is a statement of the obvious. In the Milton Model truisms are used in sets to produce a spurious cause and effect. The client listens to the first truism statement, and agrees with it. The client listens to the next truism, and agrees with that too. The next suggestion is then made while the agreement with the truism is still in mind, so it too will be accepted as true, even if it has nothing to do with the first statements. ",
        "examples": [
            "People are happiest when they feel loved and needed",
            "There are times when everyone underestimates their own talent'",
            "Everyone wants to be liked, and everyone needs to be loved, and you are learning to listen to your emotions",
        ],
    },
    {
        "name": "Universal Quantifier",
        "definition": "The Milton Model uses statements with words such as 'all, every, always, never, any, everybody, nobody, no one' that act to generalize a particular statement. Universal quantifiers always have an element of exaggeration.",
        "examples": [
            "All that has gone before is a resource for you.",
            "Every word you hear can be a signal to your unconscious ",
            "No one can fail once they really decide to change",
        ],
    },
    {
        "name": "Unspecific Comparison",
        "definition": "A typical Milton Model statement will use words to imply something, and relies on the mind being to busy listening to the next words to really question the truth or logic of the what was just heard. In a classic Milton Model statement, a comparison is made, but does not specify what is being compared with.",
        "examples": [
            "You will find yourself changing faster ",
            "and you may find you are much more relaxed",
            "Every day in every way, you are getting better and better",
        ],
    },
    {
        "name": "Unspecific Object",
        "definition": "These are words that sound good but are actually quite vague. Milton Model words such as 'learnings, outcomes, resources, findings, consideration' etc., can be used to ground almost anything, which makes the suggestion bullet proof. By using inclusive words the client finds closure from their own resources. If you agreed with the previous sentence you might want to re-read it, and consider whether it means anything at all.",
        "examples": [
            "And then come back to the present with all the learnings you need.",
            "Your understanding will help make the changes clear'",
            "You can open your mind to full consideration of everything that matters",
        ],
    },
    {
        "name": "Unspecific Verb",
        "definition": "Like the Milton Model unspecific objects, Milton Model verbs sound good but are hard to pin down. The unconscious mind accepts the word in context and supplies its own meaning. Words such as 'wonder, change, understand, think, feel' etc., are non-specific and can apply to anything.",
        "examples": [
            "and you may be wondering about how best to go into trance",
            "and soon the time will come when you grasp all this",
            "your unconscious mind will understand everything it needs",
        ],
    },
]
