[
    {
        "name": "Undermining",
        "definition": "Deliver a compliment first, and slightly weaken it.",
        "examples": [
            "You're the hottest girl I've met ... in the last ten minutes.",
            "You are so cute. It's almost sickening.",
            "I feel so attracted to you, as a friend.",
            "Get away from me, I can't have you around. You're way too cute and tempting",
            "You know, I bet we'd make a really good couple. Nah, scratch that, I bet we'd fight all the time",
            "We would never get along, we are too similar",
            "I would invite you over sometime, but something is creepy about you",
            "Hey, you have beautiful eyes... They are almost as pretty as mine",
            "Come here, let me see your cute face. Nope, never mind, you look way too much like a little girl for me, I'm no pedophile.",
        ]
    },
    {
        "name": "Ranking",
        "definition": "Use ranking to weaken the previous compliment.",
        "examples": [
            "You have a breathtakingly beautiful smile ... it's the third best I've seen tonight.",
            "I love the way you kiss my neck. It's so sexy I've only known three girls that can do equally good.",
        ]
    },
    {
        "name": "Body Mixin",
        "definition": "Use body language to indicate push or pull.",
        "examples": [
            "Hug a girl then whisper in her ear I hate u so much.",
            "Hug her and then say \"Ok, that's enough\" physically pushing her a little bit",
            "Grab her and pull her into you... stare into her eyes... then scoff as if she said something lame and let her go, shaking your head and looking away.",
        ]
    },
    {
        "name": "Imagination",
        "definition": "Use imagination to deliver a push after setting up a pull.",
        "examples": [
            "You could be a model if taller and thinner.",
            "If I was into brunettes, I would be all over you.",
            "You're totally not my type, you're way too much of a tough girl. But if you had a sweet spot, you'd probably be my kind of girl.",
        ]
    },
    {
        "name": "Either Or",
        "definition": "Calibrate push and pull in a clever way.",
        "examples": [
            "You are either the coolest girl I've ever met or a total weirdo.",
            "You are either really smart ... or a bimbo.",
            "You're either the coolest girl that I've ever meet or you're the most crazy one",
        ]
    },
    {
        "name": "Elementalism",
        "definition": "Another way to calibrate push and pull.",
        "examples": [
            "Part of me wants to stay here with you, but another part wants to run away.",
        ]
    },
]
