[
    {
        "name": "ALLITERATION",
        "definition": "A rhetorical device that repeats the same sound or letter beginning several words in sequence.",
        "examples": [
            "\"Let us go forth to lead the land we love\" - J. F. Kennedy",
            "\"My style is public negotiations for parity, rather than private negotiations for position\" - Jesse Jackson",
            "\"Veni, vidi, vinci \" - Julius Caesar",
            "\"We want no parlay with you and your grisly gang who work your wicked will\" -Winston Churchill",
            "\"That power ... which derives strength and perverted pleasure from persecution\" - Sir Winston Churchill",
            "\"Step forward, Tin Man. You dare to come to me for a heart, do you? You clinking, clanking, clattering collection of caliginous junk...And you, Scarecrow, have the effrontery to ask for a brain! You billowing bale of bovine fodder !\" - the Wizard of Oz",
            "“Our party ...has always been at its best when we’ve led not by polls, but by principle; not by calculation, but by conviction ...” - Barack Obama",
            "\"You'll never put a better bit o' butter on your knife\" -advertising slogan, Country Life butter",
        ]
    },
    {
        "name": "ALLUSION",
        "definition": "A short reference to a famous person or event (the best sources for allusions are literature, history, Greek myth, and the Bible, as they must be easily understood). It is also important that it explains, or enhances the subject under discussion without sidetracking the listener.",
        "examples": [
            "\"You must borrow me Gargantua's mouth first. 'Tis a word too great for any mouth of this age's size\" - Shakespeare",
            "\"If you take his parking place, you can expect World War II all over again\"",
        ]
    },
    {
        "name": "AMPLIFICATION",
        "definition": "A figure of speech that repeats a word or expression while adding more detail to it, in order to emphasize something.",
        "examples": [
            "\"I know I have but the body of a weak and feeble woman; but I have the heart of a king, and of a king of England, too\" - Queen Elizabeth I",
        ]
    },
    {
        "name": "ANADIPLOSIS",
        "definition": "The repetition of the last word of a clause or sentence at the beginning of the next.",
        "examples": [
            "\"I am Sam, Sam I am\" - Dr. Seuss (Green Eggs and Ham)",
            "\"The love of wicked men converts to fear , That fear to hate, and hate turns one or both To worthy danger and deserved death\" - William Shakespeare ",
            "\"Men in great place are thrice servants: servants of the sovereign or state; servants of fame; and servants of business\" - Francis Bacon",
            "\"They call for you: the general who became a slave ; the slave who became a gladiator; the gladiator who defied an Emperor\" - Joaquin Phoenix (from the movie Gladiator )",
        ]
    },
    {
        "name": "ANALOGY",
        "definition": "A kind of extended METAPHOR or long SIMILE in which a comparison is made between two things in order to develop a line of reasoning. While it is similar to simile, similes are generally more artistic and brief, while an analogy is longer and explains a thought process.",
        "examples": [
            "\"Knowledge always desires increase: it is like fire, which must first be kindled by some external agent, but which will afterwards propagate itself\" - Samuel Johnson",
        ]
    },
    {
        "name": "ANAPHORA",
        "definition": "A rhetorical device that repeats the same word or words at the beginning of successive phrases, or sentences, often alongside CLIMAX and PARALLELISM and using a TRICOLON. It is the direct opposite of ANTISTROPHE.",
        "examples": [
            "\"To think on death it is a misery,/ To think on life it is a vanity;/ To think on the world verily it is,/ To think that here man hath no perfect bliss\" - Peacham",
            "\"But one hundred years later, the Negro still is not free. One hundred years later, the life of the Negro is still sadly crippled by the manacles of segregation and the chains of discrimination. One hundred years later, the Negro lives on a lonely island of poverty in the midst of a vast ocean of material prosperity. One hundred years later, the Negro is still languished in the corners of American society and finds himself an exile in his own land\" - Martin Luther King, Jnr.",
            "\"But in a larger sense, we cannot dedicate, we cannot consecrate, we cannot hallow this ground \" - Abraham Lincoln",
            "“For us, they packed up their few worldly possessions and travelled across oceans in search of a new life. For us, they toiled in sweatshops and settled the West; endured the lash of the whip and ploughed the hard earth. For us, they fought and died, in places like Concord and Gettysburg; Normandy and Khe Sahn” - Barack Obama",
            "\"Brylcreem, a little dab'll do ya, Brylcreem, you'll look so debonair! Brylcreem, the gals'll all pursue ya!\" - advertising jingle for Brylcreem",
            "\"I needed a drink, I needed a lot of life insurance, I needed a vacation, I needed a home in the country. What I had was a coat, a hat and a gun\" - Raymond Chandler (Farewell, My Lovely)\"",
            "\"I want to shake off the dust of this one-horse town. I want to explore the world. I want to watch TV in a different time zone. I want to visit strange, exotic malls. I’m sick of eating hoagies! I want a grinder, a sub, a foot-long hero! I want to LIVE, Marge!\" - Homer Simpson, The Simpsons ",
            "\"Last night, Japanese forces attacked Hong Kong. Last night, Japanese forces attacked Guam. Last night, Japanese forces attacked the Philippine Islands. Last night, the Japanese attacked Wake Island. And this morning, the Japanese attacked Midway Island\" - Franklin D Roosevelt",
        ]
    },
    {
        "name": "ANASTROPHE",
        "definition": "A departure from normal word order for the sake of emphasis",
        "examples": [
            "\"Four score and seven years ago\" - Abraham Lincoln",
            "\"This much we pledge, and more\" - JF Kennedy",
        ]
    },
    {
        "name": "ANTISTROPHE",
        "definition": "A figure of speech that repeats the same word or phrase at the end of successive clauses, i.e. the direct opposite of ANAPHORA.",
        "examples": [
            "\"A day may come when the courage of men fails, when we forsake our friends and break the bonds of fellowship, but it is not this day . An hour of wolves and shattered shields, when the age of men comes crashing down, but it is not this day. This day we fight!\" - King Aragorn (from the movie 'The Return of the King'),",
            "\"It was a creed written into the founding documents that declared the destiny of a nation: Yes, we can. It was whispered by slaves and abolitionists as they blazed a trail towards freedom through the darkest of nights: Yes, we can. It was sung by immigrants as they struck out from distant shores and pioneers who pushed westward against an unforgiving wilderness: Yes, we can\" - Barack Obama",
        ]
    },
    {
        "name": "ANTITHESIS",
        "definition": "One of the most common rhetorical devices, this deliberately contrasts two opposing ideas in consecutive phrases or sentences.",
        "examples": [
            "\"I have a dream that my four little children will one day live in a nation where they will not be judged by the colour of their skin but by the content of their character\" -- Martin Luther King, Jr.",
            "\"We must learn to live together as brothers or perish together as fools\" - Martin Luther King, Jr ",
            "\"Reasonable men adapt to the world. Unreasonable men adapt the world to themselves . That's why all progress depends on unreasonable men\" - George Bernard Shaw",
            "\"No bastard ever won a war by dying for his country. He won it by making the other poor bastard die for his country\" - General George Patton",
            "\"That's one small step for a man , one giant leap for mankind\" --Neil Armstrong",
            "\"To be or not to be , that is the question\" - William Shakespeare (Hamlet)",
            "“The success of our economy has always depended not just on the size of our Gross Domestic Product, but on the reach of our prosperity ...” - Barack Obama",
            "\"It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of Light, it was the season of Darkness, it was the spring of hope, it was the winter of despair, we had everything before us, we had nothing before us, we were all going direct to Heaven, we were all going direct the other way\" - Charles Dickens (A Tale of Two Cities)",
        ]
    },
    {
        "name": "ASSONANCE",
        "definition": "The successive use of different syllables with the same or similar vowel sounds in words with different consonants. It is similar to rhyme, but can be used with similar sounding words, as in the Churchill example.",
        "examples": [
            "\"Our flag is red, white, and blue -- but our national is rainbow. Red, yellow, brown, black, and white , we're all precious in God's sight\" - Jesse Jackson",
            "\"I feel the need , the need for speed\" -- Tom Cruise (from the movie Top Gun)",
            "\"The odious apparatus of Nazi rule\" - Winston Churchill",
            "\"It beats as it sweeps as it cleans\" - advertising slogan for Hoover vacuum cleaners",
        ]
    },
    {
        "name": "ASYNDETON",
        "definition": "A lack of conjunctions (e.g. 'and') between successive phrases or words.",
        "examples": [
            "\"We shall pay any price, bear any burden, meet any hardships, support any friend, oppose any foe to assure the survival and the success of liberty\" - JF Kennedy, Inaugural",
            "Instead, they knew that our power grows through its prudent use; our security emanates from the justness of our cause, the force of our example, the tempering qualities of humility and restraint” - Barack Obama",
        ]
    },
    {
        "name": "CHIASMUS",
        "definition": "A very effective technique where the words in one phrase or clause are reversed in the next.",
        "examples": [
            "\" But just because you're born in the slum does not mean the slum is born in you, and you can rise above it if your mind is made up\" - Jesse Jackson",
            "\"It's not the men in my life that counts: it's the life in my men \" - Mae West",
            "\"And so, my fellow Americans, ask not what your country can do for you; ask what you can do for your country\" -- John F. Kennedy, Inaugural Address",
            "\"When the going gets tough, the tough get going\" - unknown",
            "\"Whether we bring our enemies to justice or bring justice to our enemies, justice will be done\"- President George W Bush",
            "\"If black men have no rights in the eyes of the white men, of course the whites can have none in the eyes of the blacks\" - Frederick Douglass",
            "\"The true test is not the speeches the president delivers; it's if the president delivers on the speeches\" - Hilary Clinton",
            "\"I'd rather be looked over than overlooked\" - Mae West (again)",
            "\"Is man one of God's blunders or God one of man's blunders?\" - Friedrich Nietzsche",
            "\"One should eat to live, not live to eat\" - Cicero",
            "\"The art of progress is to preserve order amid change and to preserve change amid order\" - Alfred North Whitehead",
            "\"Your manuscript is both good and original; but the part that is good is not original, and the part that is original is not good\" - Samuel Johnson",
        ]
    },
    {
        "name": "CLIMAX",
        "definition": "A figure of speech where words or phrases are arranged in order of increasing importance or emphasis. It is often used with PARALLELISM because it offers a sense of continuity, order, and movement-up the ladder of importance.",
        "examples": [
            "\"Veni, vidi, vinci \" - Julius Caesar (\"I came, I saw, I conquered\")",
            "\"And from the crew of Apollo 8, we close with good night, good luck, a merry Christmas, and God bless all of you, all of you on the good earth\" - Frank Borman, Apollo 8 astronaut",
            "And now I ask you ladies and gentlemen, brothers and sisters, for the good of all of us, for the love of this great nation, for the family of America, for the love of God ; please make this nation remember how futures are built \" - Mario Cuomo, Governor of New York",
        ]
    },
    {
        "name": "DIACOPE",
        "definition": "This repeats a word or phrase after an intervening word or phrase.",
        "examples": [
            "\"Free at last, free at last ; thank God almighty, free at last!\" - Martin Luther King",
            "\"The people everywhere , not just here in Britain, everywhere -- they kept faith with Princess Diana\" - Tony Blair",
        ]
    },
    {
        "name": "DISTINCTIO",
        "definition": "An elaboration on a particular meaning of a word in order to prevent any misunderstanding or ambiguity:",
        "examples": [
            "\"In modern times (and here I am referring to the post-World War Two era) ...\"",
            "\"The task could be described as difficult, if by difficult we mean that it will entail hardship\"",
            "\"The operation will need to be completed quickly; that is, within three months\"",
        ]
    },
    {
        "name": "EPISTROPHE",
        "definition": "a rhetorical device which repeats the last word(s) in one phrase or sentence at the end of successive ones.",
        "examples": [
            "\"...and that government of the people, by the people, for the people shall not perish from the earth\" - Abraham Lincoln",
        ]
    },
    {
        "name": "EPONYM",
        "definition": "The substitution of the name of a famous person recognized or famous for a particular attribute, for that attribute. By their nature they often border on the clichéd, but many times they can be useful without seeming too obviously trite. While finding new or infrequently used ones is best, it is also more difficult, because the name-and-attribute relationship needs to be well established:",
        "examples": [
            "\"You don't need to be Einstein to see that .... \"",
            "\"That little Hitler is fooling nobody\"",
            "\"We all must realize that Uncle Sam is not supposed to be Santa Claus\"",
        ]
    },
    {
        "name": "EXPLETIVE",
        "definition": "A word or short phrase that interrupts normal speech in order to lend emphasis to the words immediately next to it:",
        "examples": [
            "\"... we shall never surrender, and even if, which I do not for a moment believe, this Island or a large part of it were subjugated and starving ..\" - Winston Churchill",
            "And this city (Prague) -- this Golden City which is both ancient and youthful --stands as a living monument to your unconquerable spirit\" - Barack Obama",
        ]
    },
    {
        "name": "HYPERBOLE",
        "definition": "The deliberate exaggeration for emphasis or effect, i.e. the opposite of MEIOSIS. It must be clearly intended as an exaggeration, and should be used sparingly to be effective. That is, don'tt exaggerate everything, but treat hyperbole like an exclamation point, to be used only occasionally.",
        "examples": [
            "\"Ladies and gentlemen, I've been to Vietnam, Iraq, and Afghanistan, and I can say without hyperbole that this is a million times worse than all of them put together\" - Kent Brockman (The Simpsons) ",
            "\"This chicken is so underdone a skilled vet could probably bring it back to life\"",
            "\"This stuff is used motor oil compared to the coffee at Starbuck's\"",
        ]
    },
    {
        "name": "HYPOPHORA",
        "definition": "A figure of reasoning in which one or more questions or objections is/are asked or stated and then answered by the speaker; reasoning aloud (i.e. the original 'rhetorical question)'.",
        "examples": [
            "\"When the enemy struck on that June day of 1950, what did America do? It did what it always has done in all its times of peril. It appealed to the heroism of its youth\" - Dwight D. Eisenhower",
            "\"'But there are only three hundred of us,' you object. Three hundred, yes, but men, but armed, but Spartans, but at Thermoplyae: I have never seen three hundred so numerous\" - Seneca",
        ]
    },
    {
        "name": "LITOTES",
        "definition": "A particular form of understatement, which denies the opposite of the word which otherwise would be used",
        "examples": [
            "\"I am not unmindful that some of you have come here out of great trials and tribulations\" - Martin Luther King, Jr.",
        ]
    },
    {
        "name": "MEIOSIS",
        "definition": "A deliberate understatement, i.e. the opposite of HYPERBOLE.",
        "examples": [
            "\"The situation has developed, not necessarily to our advantage\" - Emperor Hirohito, announcing to the Japanese people that atomic bombs had been dropped on Hiroshima and Nagasaki",
            "\"It's just a flesh wound\" - The Black Knight, having just had both arms chopped off, in Monty Python and the Holy Grail",
            "\"I'm going outside and may be some time\" - Capt. Lawrence Oates, Antarctic explorer, before leaving his tent to certain death in a blizzard, 1912",
        ]
    },
    {
        "name": "MESODIPLOSIS",
        "definition": "The repetition of the same words in the middle of successive sentences:",
        "examples": [
            "\"We are troubled on every side, yet not distressed; we are perplexed, but not in despair; persecuted, but not forsaken; cast down, but not destroyed\". —2 Corinthians 4:8-9",
            "\"Today in America, a teacher spent extra time with a student who needed it, and did her part to lift America’s graduation rate to its highest level in more than three decades. An entrepreneur flipped on the lights in her tech startup, and did her part to add to the more than eight million new jobs our businesses have created over the past four years. An autoworker fine-tuned some of the best, most fuel-efficient cars in the world, and did his part to help America wean itself off foreign oil\". - President Obama, 2014 SOTU",
            "\"American leadership depends on a military so strong that no one would think to engage it. Our military strength depends on an economy so strong that it can support such a military. And our economy depends on a people so strong, so educated, so resolute, so hard working, so inventive, and so devoted to their children's future, that other nations look at us with respect and admiration\" - Mitt Romney",
        ]
    },
    {
        "name": "METABASIS",
        "definition": "A brief statement of what has been said and what will follow; a kind of transitional summary:",
        "examples": [
            "\"So far I have concentrated only on the costs of the proposal. I now want to turn to the benefits\"",
            "\"So much for the achievements of last year. Let's look at the objectives for this one\"",
        ]
    },
    {
        "name": "METANOIA",
        "definition": "This qualifies a statement by recalling it (or part of it) and expressing it in a better, milder, or stronger way. A negative (e.g. 'nay' though this would be a little theatrical in a business speech or presentation) is often used to do the recalling:",
        "examples": [
            "\"Fido was the friendliest of all St. Bernards, nay of all dogs\"",
            "\"And if I am still far from the goal, the fault is my own for not paying heed to the reminders-- nay, the virtual directions --which I have had from above\" - Marcus Aurelius",
            "\"Even a blind man can see, as the saying is, that poetic language gives a certain grandeur to prose, except that some writers imitate the poets quite openly, or rather they do not so much imitate them as transpose their words into their own work, as Herodotus does\" -Demetrius",
        ]
    },
    {
        "name": "METAPHOR",
        "definition": "The comparison of two different things by speaking of one in terms of the other. Unlike a SIMILE or ANALOGY, a metaphor asserts that one thing actually is another thing, not just like it.",
        "examples": [
            "\"From Stettin in the Baltic to Trieste in the Adriatic an iron curtain has descended across the Continent\" - Sir Winston Churchill",
            "\"All the world's a stage, and all the men and women merely players\" - William Shakespeare",
            "\"You shall not press down upon the brow of labor this crown of thorns, you shall not crucify mankind upon a cross of gold\" - WJ Bryan, arguing against the introduction of the Gold Standard",
            "\"It came as a joyous daybreak to end the long night of their captivity\" - Martin Luther King Jnr.",
            "\"The torch has been passed to a new generation of Americans\" - President JF Kennedy",
            "\"The mother of all battles\" - Sadaam Hussein",
            "“The (Presidential Oath has) been spoken during rising tides of prosperity and the still waters of peace. Yet, every so often the oath is taken amidst gathering clouds and raging storms” -Barack Obama",
        ]
    },
    {
        "name": "MESODIPLOSIS",
        "definition": "The repetition of a word or words in the middle of successive clauses or sentences.",
        "examples": [
            "\"... you can get ahead, no matter where you come from, what you look like, or who you love\" - Barack Obama",
            "\"Because in those eyes, they will see what my parents saw in me, and what your parents saw in you\" - Marco Rubio",
        ]
    },
    {
        "name": "PARALLELISM",
        "definition": "A device which is a figure of balance identified by successive words or phrases with the same or very similar grammatical structure.",
        "examples": [
            "\"In 1931, ten years ago, Japan invaded Manchukuo -- without warning . In 1935, Italy invaded Ethiopia -- without warning . In 1938, Hitler occupied Austria -- without warning . In 1939, Hitler invaded Czechoslovakia -- without warning. Later in 1939, Hitler invaded Poland -- without warning . And now Japan has attacked Malaya and Thailand -- and the United States -- without warning\" - Franklin D. Roosevelt",
            "\"Veni, vidi, vinci \" - Julius Caesar (\"I came, I saw, I conquered\")",
            "\"Let every nation know, whether it wishes us well or ill, that we shall pay any price, bear any burden, meet any hardship, support any friend, oppose any foe to assure the survival and the success of liberty\" -- John F. Kennedy,",
            "\"We have seen the state of our Union in the endurance of rescuers, working past exhaustion. We've seen the unfurling of flags, the lighting of candles, the giving of blood, the saying of prayers -- in English, Hebrew, and Arabic\" - George W. Bush",
            "\"My name is Maximus Decimus Meridius, Commander of the Armies of the North, General of the Felix Legions, loyal servant to the true emperor, Marcus Aurelius, father to a murdered son, husband to a murdered wife, and I will have my vengeance -- in this life or the next\" - Russell Crowe (from the movie Gladiator)",
            "\"Tell me and I forget. Teach me and I may remember. Involve me and I will learn\" - Benjamin Franklin",
            "“Our workers are no less productive than when this crisis began. Our minds are no less inventive, our goods and services no less needed\" - Barack Obama",
        ]
    },
    {
        "name": "POLYSYNDETON",
        "definition": "The repetitive and deliberate use of a conjunction between each word, phrase, or clause, and therefore the opposite of ASYNDETON.",
        "examples": [
            "\"Behold, the Lord maketh the earth empty, and maketh it waste, and turneth it upside down, and scattereth abroad the inhabitants thereof. And it shall be, as with the people, so with the priest; as with the servant, so with his master; as with the maid, so with her mistress; as with the buyer, so with the seller; as with the lender, so with the borrower; as with the taker of usury, so with the giver of usury to him\" --Isaiah 24:1-2",
            "\". . . and it was dark and there was water standing in the street and no lights and windows broke and boats all up in the town and trees blown down and everything all blown and I got a skiff and went out and found my boat where I had her inside Mango Bay and she was all right only she was full of water\"- Ernest hemingway (After the Storm)",
            "\"Time and again these men and women struggled and sacrificed and worked till their hands were raw so that we might live a better life. They saw America as bigger than the sum of our individual ambitions;greater than all the differences of birth or wealth or faction\" - Barack Obama",
        ]
    },
    {
        "name": "PRAETERITIO",
        "definition": "A pretended omission for rhetorical effect.",
        "examples": [
            "\"That part of our history detailing the military achievements which gave us our several possessions ... is a theme too familiar to my listeners for me to dilate on, and I shall therefore pass it by\" - Thucydides",
            "\"Let us make no judgment on the events of Chappaquiddick , since the facts are not yet all in\" - a political opponent of Senator Edward Kennedy",
            "\"It would be unseemly for me to dwell on the honourable member's drinking problem, and too many have already sensationalized his womanizing...\"",
            "\"We will not speak of all Queequeg's peculiarities here ; how he eschewed coffee and hot rolls, and applied his undivided attention to beefsteaks, done rare\" - Herman Melville , Moby Dick",
        ]
    },
    {
        "name": "SCESIS ONOMATON",
        "definition": "A figure of speech which emphasises something by expressing it in a string of generally synonymous phrases or statements. While it should be used carefully, this deliberate and obvious restatement can be quite effective. Although it can use more than three, it tends to be most effective when used in conjunction with a TRICOLON:",
        "examples": [
            "\"We succeeded, we were victorious, we accomplished the feat!\"",
            "\"A sinful nation, a people laden with iniquity, a seed of evildoers, children that deal corruptly\" --Isaiah 1:4",
            "\"But there is one thing these glassy-eyed idealists forget: such a scheme would be extremely costly, horrendously expensive, and require a ton of money\"",
            "\"That is heart-breaking, it is wrong, and no one should be treated that way in the United States of America” - Barck Obama",
        ]
    },
    {
        "name": "SENTENTIA",
        "definition": "A figure of argument in which a wise, witty, or well-known saying is used to sum up the preceding material.",
        "examples": [
            "\"So, I'm happy tonight. I'm not worried about anything. I'm not fearing any man. 'Mine eyes have seen the glory of the coming of the Lord' \" -- Martin Luther King, Jr,",
        ]
    },
    {
        "name": "SIMILE",
        "definition": "A comparison between two different things that resemble each other, comparing an unfamiliar thing to some familiar thing known to the listener, usually prefaced with the word 'like':",
        "examples": [
            "\"He bestrides this narrow world like a colossus\" - William Shakespeare",
            "\"My love is like a red, red rose \" - Robert Burns",
            "\"Let us go then, you and I, where the evening is spread out across the sky like a patient etherised upon a table\" - T.S. Eliot",
            "\"We're going to go through them like crap through a goose\" - General George Patton",
            "\"Seeing John Major govern the country is like watching Edward Scissorhands try to make balloon animals\"- Simon Hoggart",
            "\"It's like being savaged by a dead sheep\" - Labour politician Dennis Healey on being verbally attacked by Tory minister Sir Geoffrey Howe",
        ]
    },
    {
        "name": "SYMPLOCE",
        "definition": "This repeats the the first and last word or words in one phrase or sentence in one or more successive ones, combining ANAPHORA and ANTISTROPHE",
        "examples": [
            "\"In 1931, ten years ago, Japan invaded Manchukuo -- without warning . In 1935, Italy invaded Ethiopia -- without warning . In 1938, Hitler occupied Austria -- without warning . In 1939, Hitler invaded Czechoslovakia -- without warning. Later in 1939, Hitler invaded Poland -- without warning . And now Japan has attacked Malaya and Thailand -- and the United States -- without warning\" - Franklin D. Roosevelt",
            "\"Much of what I say might sound bitter, but it's the truth . Much of what I say might sound like it's stirring up trouble, but it's the truth. Much of what I say might sound like it is hate, but it's the truth\" - Malcolm X",
            "\"There are many people in the world who really don't understand, or say they don't, what is the great issue between the free world and the Communist world. Let them come to Berlin . There are some who say that communism is the wave of the future. Let them come to Berlin . And there are some who say, in Europe and elsewhere, we can work with the Communists. Let them come to Berlin. And there are even a few who say that it is true that communism is an evil system, but it permits us to make economic progress. Lass' sie nach Berlin kommen. Let them come to Berlin\" - JF Kennedy",
            "\"In the struggle for peace and justice, we cannot walk alone. In the struggle for opportunity and equality, we cannot walk alone. In the struggle to heal this nation and repair this world, we cannot walk alone\" - Barack Obama",
        ]
    },
    {
        "name": "TRICOLON",
        "definition": "The use of words, phrases, examples, or the beginnings or endings of phrases or sentences in threes.",
        "examples": [
            "\"Government of the people, by the people, for the people\" ... President Abraham Lincoln",
            "\"Never in the history of human endeavour has so much been owed by so many to so few\" ... Sir Winston Churchill",
            "“Tell me and I forget. Teach me and I may remember. Involve me and I will learn” – Benjamin Franklin",
            "“The God-given promise that all are equal, all are free, and all deserve a chance to pursue their full measure of happiness\" - Barack Obama",
        ]
    },
]
