[
    {
        "name": "Analogy",
        "definition": "Use descriptive words and expressions to create attractive and touching impressions.",
        "examples": [
            "很快一场灾难就要降临到他的身上，但同时，一个伟大的事业也在等待着他，只有像传说中的凤凰一样，历经苦难，投入火中，经过千锤百炼，才能浴火重生，成为光芒万丈的神鸟。",
            "朱元璋的这个行动似乎可以定义为一次挑选公务员的工作，比例是三十比一，没有笔试，考官就是朱元璋和他的眼光。他挑的确实很准，看看这些人的名字：徐达、汤和、周德兴，这二十四个人后来都成为了明王朝的高级干部。",
            "在通往胜利之门的路上，你会捡到很多钥匙，这些钥匙有的古色古香，有的金光闪闪，但只有一把才能打开那扇门。在进行决策时，会有很多人在你耳边提出他们自己的意见，将他们手中的钥匙交给你，让你去选择，但这个游戏最残酷的地方在于：你只有一次尝试的机会。如果失败了，你将失去一切。",
            "在成为名将的道路上，我们要经历六个坎坷，让我们以六个年级来标明他们，只有战胜眼前的坎坷，才能升入下一个年级。当然，有些天才同学不需要经过这六个年级，生下来就会打仗，也是有的，不过极少，我们可以忽略。",
            "如果把靖难比作一场足球赛，李景隆原先的行为可以被认为是一个蹩脚的后卫踢进了乌龙球，而在他决定出卖自己的主人后，他就变成了一个打假球的人。",
            "在总结经验教训后，明军终于找到了一套能够有效克制蒙古骑兵的战法，本人给明军使用的这套战法取了一个名字，叫“要你命三板斧战斗系统”。",
            "它在这个幽静的夜晚，诞生于僻静而不为人知的山谷，悄无声息，但它的光芒终将照耀整个世界，它的智慧将成为无数人前进的向导。",
        ]
    },
    {
        "name": "But",
        "definition": "Use 'But' to create a turning point that gains focus.",
        "examples": [
            "在很多的书中，朱重八被塑造成一个天生英雄的形象，于是在这样的剧本里，天生英雄的朱重八一听说起义了，马上回寺庙里操起家伙就投奔了起义军，表现了他彻底的革命性等等。我认为，这不是真实的朱重八。",
            "他要创造一个真正纯净的王朝，一个官员们人人清廉、百姓安居乐业的王朝。所以他尽一切努力去实现这个梦想。可是梦想不一定会成为现实。",
            "这就是所谓的性格决定命运吧，而关键问题在于，蓝玉的命运并不完全掌握在他自己的手中，在很大程度上，他的生死只取决于朱元璋的容忍和耐心，而朱元璋并不是个有耐心的人。",
            "朱元璋告诉朱允炆，方孝孺是绝对可以信任的，他的一生都会效忠于你，并能为你治理国家，开创太平盛世。这话他只说对了一半。",
            "朱棣迁都的行为招致了当时众人的反对，很多人也断言此举必不可行，但十九年后站在北京城头遥望远方的于谦应该不会这样想。",
            "王华沉默了，过了很久，才如梦初醒，终于做出了反应。他十分激动地顺手拿起手边的书（一时找不到称手的家伙），劈头盖脸地向王守仁打去，一边打还一边说：“让你小子狂！让你小子狂！”",
        ]
    },
    {
        "name": "Categorization",
        "definition": "List categories to make situations clear, and also a potential trap for breaking the presumptions.",
        "examples": [
            "接下来的是痛苦的思考和抉择朱重八面前有三条路：一、守在寺庙里；二、逃跑；三、造反。",
            "王保保经过了周密的准备和计划，带领了十万大军，向大都攻击。但在他的心中，却有着两种打算，如果徐达不去救援，他就趁机攻下大都，迎接元顺帝归位。如果徐达来援，他就以逸待劳，设下圈套，伏击徐达。这是一个万无一失的计划，无论徐达选择哪条路，他都是胜利者。",
            "而京城的朱允炆应该也从此战中获得了不少教训和经验，在我看来，至少有三条：1、李景隆确实是军事蠢材，应该像扔垃圾一样扔掉；2、环境保护是个大问题，应该多搞点绿化，防止大风扬沙天气的蔓延；3、旗杆应该换成铁制，不可偷工减料。",
            "能够进城的只有两种人，胜利者，或是尸体！",
            "在这种情况下，成化年间的政治顿时变得异彩纷呈，黑暗无比，而涌现出的各个政治流派更是多姿多彩，百花齐放，聚集在这个混乱的江湖中，召开了一场花招层出不穷、犯规屡禁不止的武林大会。下面我们开始介绍参加武林大会的各大门派（排名不分先后）。",
        ]
    },
    {
        "name": "Comment",
        "definition": "Add comments to create dramatic effects.",
        "examples": [
            "当时的徐寿辉整编部队的手法实在厉害，他在每个士兵的背后写下了一个佛字，并说这样可以刀枪不入，这个谎话似乎容易被揭穿，因为士兵到了战场上就会发现不是真的（不信扎你一枪试试）",
            "于谦虽然是文官，但他对兵法也有研究，排兵布阵很有一套，相信是小时候看课外书打下的基础。所以说，课外读物实在是必不可少的。",
            "当夜，朱祁镇在午门召开大会，宣布判处曹吉祥死刑（注：凌迟处死），与他一同被处决的还有在曹家混饭吃的冯益（多说了一句话），业务不精的天文学家汤序（其实我认为他应该算是有功之臣）。",
            "张永好奇地打开了文书，一看之下不禁目瞪口呆。这份文书上不但列明了刘瑾的所有罪状，还有各种证据列举，细细一数，竟然有十七条！而且文笔流畅，逻辑清晰，语言生动，实在是一篇难得的好文章。他倒抽一口凉气，看着泰然自若的杨一清，不再多言，收好了文书，掉转马头就此上路。娘的，读书人真是惹不起啊！",
        ]
    },
    {
        "name": "Contrast",
        "definition": "Use contrast to highlight what you want to emphasize.",
        "examples": [
            "长期的困难生活，最能磨练一个人的意志，有很多人在遇到困难后，只能怨天尤人，得过且过，而另外一些人虽然也不得不在困难面前低头，但他们的心从未屈服，他们不断的努力，相信一定能够取得最后的胜利。朱重八毫无疑问是后一种。",
            "朱高煦目瞪口呆，自己都准备投降了，这个部下竟然还如此有骨气。他顿时精神大振，表示自己一定与城池共存亡！发表完慷慨激昂的演讲后，朱高煦昂首挺胸地走回了自己的指挥位置。然后他换了一条小路，偷偷溜出城池，去向朱瞻基投降，还发表了他的投降演讲：“我罪该万死，全由皇上发落！”",
            "洪武三十一年（1398），明帝国送走了它的缔造者——朱元璋，这对于帝国而言，是一个不小的损失。但也就在同一年，浙江钱塘县（现属杭州市）的一个普通家庭诞生了一个帝国未来的拯救者。这自然就是我们的主角于谦。",
            "武将石亨历经沙场，砍头无数，被称为正统第一勇将，却临阵慌乱，不知所措，他的所谓勇敢不过是匹夫之勇而已。在这场危险的游戏中，手无缚鸡之力的徐有贞才是当之无愧的勇者。这并不奇怪，因为只有内心的坚韧和顽强才是真正的勇敢。",
        ]
    },
    {
        "name": "Example",
        "definition": "Use examples to clarify what you want to explain.",
        "examples": [
            "我们列举出五个官员来说明这个问题，给他们分别命名为甲、乙、丙、丁、戊，这五个人的职务是这样的，甲是兵部侍郎（三品），乙是礼部郎中（五品），丙是刑部员外郎（从五品），丁是翰林院侍讲学士（从五品），戊是布政史参议（从四品）。",
        ]
    },
    {
        "name": "Humor",
        "definition": "Use humor techniques to make it interesting.",
        "examples": [
            "元顺帝此时正在上都，听说明军攻来，他充分发挥了自己的特长——逃跑，带着老婆孩子连夜遁去。",
            "不久之后的一天，朱祐樘在整理自己老爹遗物的时候偶然发现了一个精致的小抽屉，里面放着一本包装十分精美的手抄本，收藏得如此小心隐秘，朱祐樘还以为是啥重要指示，郑重其事地准备御览一下，可这一看差点没把他气得跳起来。据记载，此书图文并茂，语言生动，且有很强的实用性。当然了，唯一的缺点在于这是一本讲述生理卫生知识的限制级图书。",
        ]
    },
    {
        "name": "If",
        "definition": "Create an imaginary condition to stimulate imaginations.",
        "examples": [
            "这两个人都是当世之豪杰，如果他们分别出现在不同的朝代，应该都能成就大业，可惜，历史注定要让这个时代热闹一点。",
            "如果有人告诉朱棣，出一笔钱，就可以让他造一把反，造反失败赔钱就行，估计朱棣就算是找银行贷款也会把钱凑足的。",
            "朱棣和朱允炆是叔侄俩，虽然现在刀兵相见，属于敌我矛盾，但万一哪天两人决定不打了，来一场认亲大会，再来个和解，转化为了人民内部矛盾，那可就大大的不妙了。朱棣没准还能当个王爷，闲来无事的时候写本回忆录，记忆起某年某月某日，某某人在某场战役中砍我一刀或者射我一箭，虽然那时朱棣可能仕途上并不得意，但要整个把小兵还是很容易的。",
            "如果成吉思汗在天有灵，见到这些不肖子孙互相打来打去，昔日风光无限的蒙古帝国四分五裂，不知作何感想。",
        ]
    },
    {
        "name": "Last Straw",
        "definition": "Gathers the energy and deliver a final touch to push it beyond the limit to release it.",
        "examples": [
            "于是，在这个马上民族统治中国六十余年后，他们的国家机器已经到了无法承受的地步，此时的元帝国就好像是一匹不堪重负的骆驼，只等那最后一根稻草。这根稻草很快就到了。",
            "可是船呢，朱元璋的这班人马不是骑兵就是步兵，唯独少了水军，他正急得不行，一个人的到来带给了他解决的方法。",
            "就这样，带空印文册成了当时一条不成为的规定，朝廷上下都知道，除了一个人例外。很不幸的是，这个人正是朱元璋。",
            "如果说当时有心理战的话，那么铁铉应该就是其中高手，他准确地抓住了朱棣的弱点。朱棣弱点并不多，但确实是有的。他的弱点就是出兵的理由。",
            "这还没完，朱棣拿出了拼命的架势，一定要做到精益求精，他还在全国各个州县寻找有某种特定能力的人，但这种能力并不是学问，那么他到底找的是什么人呢？答案是：字写得好的人。",
            "袁彬和哈铭被朱祁镇的这一行为彻底折服了，他们佩服他，却也不理解他。他们不知道，到底是什么样的力量在支持着这个人，使他在绝境中还能如此坚守自己的信念。“为什么你能一直坚持回家的希望？”“因为我相信，在那边，还有一个人在等着我回来。”",
            "这位官员的名字叫做杨善，时任都察院右都御史，他虽然是个二品官，却并不起眼，算不上什么人物，这也正是朱祁钰挑选他去的原因之一，可惜朱祁钰并不知道，这位杨善先生是一个身怀绝技的人，而他的这项绝技即使在整个明代历史中所有同类型的人里也可算得上是数一数二的。杨善的这项绝技，就是说话。",
            "事实上，朱厚照之所以如此执著，锲而不舍地坚持出居庸关，很大程度上是为了做一件事，见一个人。这个人在《明史》中的称谓叫小王子。",
        ]
    },
    {
        "name": "Metaphor",
        "definition": "Use a metaphor to create concrete impressions.",
        "examples": [
            "对于朱元璋来说，火药已经埋藏在他的心里，就看何时爆发了。",
            "当然了，如果你有幸拿到前两张铁券，倒也不一定是好事。特别是第一版“开国辅运”，因为据有关部门统计，拿到这张铁券的人80％以上都会由朱元璋同志额外附送一张阴曹地府的观光游览券。此外还附有特别说明：单程票，适用于全家老小，可反复使用多次，不限人数。",
            "可是石亨绝对想不到的是，李贤之所以拒绝自己的好意，是因为他有着更深的图谋，为了实现这一图谋，他已经制定了一个周密的计划，并在暗中窥视着自己的猎物，随时准备打出那致命的一击。而在他的猎物名单上，有着这样三个名字：徐有贞、石亨、曹吉祥。",
        ]
    },
    {
        "name": "Numbers",
        "definition": "Use numbers to create presumptions that will expand imaginations.",
        "examples": [
            "按照军事天赋和功劳，朱文正大致可以排在将领中的第五位，这并不是因为他不够优秀，而是因为他前面的四个人都是无法超越的。",
            "说起这位朱祁镇，可能有的人会咬牙切齿，对其恨之入骨，但实际上，如果仔细分析史料，就会发现他应该不算是个坏人，他的政务处理能力也并不差，为人也很勤快，虽然有两大污点（打错一仗，杀错一人），也并不能完全抹煞他的能力与贡献。",
            "明代有很多厉害的人物，我曾给这些人物做过一个排行榜，而于谦在我看来，应该排在第二名，虽然明代有一些人物的丰功伟绩不下于甚至超过了于谦，但他们的排名也在于谦之后，这是因为评定的标准有两项：品行、才能。虽然某些人的才能确实胜过于谦，但他们的品行是有缺憾的。比如朱元璋同志的政治问题和张居正同志的经济问题。",
        ]
    },
    {
        "name": "Overlapping Sound",
        "definition": "Show what the characters are thinking directly.",
        "examples": [
            "在他眼里，什么仁义道德都是狗屁，你们不是不耻于弑君的行为吗，道学先生们，我就做给你们看看，我的年号就叫大义！",
            "王保保看着煮熟的鸭子又飞了，只能望天兴叹，此生胜不过徐达矣！",
            "到这个地步，兵书已经没用了，谁也不能告诉我敌人在哪里，要作出这个抉择，我还有什么可以依靠的呢？直觉？对，就是直觉！这里满天黄沙，遍地荒芜，没有人烟，但我能感觉到，敌人一定就在附近！可是直觉真的靠得住吗，没有情报，没有线索，没有任何踪迹。就凭自己的感觉作出如此重大的判断？",
            "从幸福的幼年到苦难的童年，再到风云变幻的成年，如今他已经是一个风烛残年的老者，经历残酷的战场厮杀，尔虞我诈的权谋诡计，还有那浩瀚大海上的风风雨雨惊涛骇浪，无数次的考验和折磨终于都挺过来了。我的梦想终于实现了，我已别无所求。",
            "底下的大臣们又是一片目瞪口呆，鸦雀无声。忠臣？您父亲不是说他们是奸党么？到您这里就给改了？那么说您父亲还是杀错了？",
            "可他没有想到，于谦对此并不感冒，反而对朱祁钰说了这样一段话：“石亨身为大将，却保举私人，应予惩戒！”搞什么名堂，保举你的儿子，不但不领情，竟然还去告状",
        ]
    },
    {
        "name": "Personification",
        "definition": "Use personification to describe in a vivid way.",
        "examples": [
            "比赛就要开始了！让我们看一下双方的选手，现在我们先欢迎元朝选手，元顺帝出场！下面请元顺帝用一句话表达他现在的心情。元顺帝：就剩一句啊，那我说了，希望对方选手下手轻点，我怕疼。现在请朱元璋选手说自己的感想，哎，朱元璋选手哪里去了。喔，我们找到他了，他正在磨刀，那我们就不打扰了。现在比赛开始！",
        ]
    },
    {
        "name": "Prophesy",
        "definition": "Statements that predict the future will have a mysterious power.",
        "examples": [
            "然而汤和也绝对不会想到，自己居然是唯一一个陪他走完这条路的人。",
            "除了这些太监之外，朱棣还和朝中的两个人有着十分秘密的关系，此二人可以说是他的王牌间谍，当然不到关键时刻，朱棣是不会用上这张王牌的，他要等待最后的时刻到来。",
            "当然朱棣绝不会想到，一百年后，这位宁王的子孙也会依葫芦画瓢，去造他后代的反。这真是应了那句名言：出来混，迟早要还的。",
            "不过事情总有例外，在明代的特务历史中，有一位锦衣卫指挥使依靠自己的才能和努力第一次压倒了东厂，这位指挥使十分厉害，在他任指挥使的时期内，锦衣卫的威名和权力要远远大于东厂，可见事在人为。",
            "自己的所有部下都被也先杀死，本人也落荒而逃，这对于一个指挥官而言，是最大的侮辱，但石亨是幸运的，在不久之后，他将有机会亲手拿起武器，为死去的同胞复仇。",
            "当然了，于谦绝对想不到的是，他的这位助手在八年后还会做出一件惊天动地的事情——致自己于死地。",
            "可他怎么都不会想到，除了太子之外，那位第四个出生的皇子在经历了无数风波之后，最终竟然也成了皇帝。",
            "然后他停了下来，意味深长地看着杨一清：“等到需要你的时候，我自然会去找你的。”",
        ]
    },
    {
        "name": "Research",
        "definition": "Do a research to show the depth of the topic being discussed.",
        "examples": [
            "百万军中如何取上将首级？这里分析一下战争中的这种奇特现象，百万军中如何取上将首级，如果经过仔细研究就会发现，这是个技术活。",
            "有的朋友可能已经注意到了，此时的朱元璋已经不再是那个贫农乞丐，他已经成为了地主，他是怎样变成地主的，这其中牵涉到一个封建社会的历史规律问题，我们有必要探讨一下。",
            "【怎样战胜骑兵】自古以来，骑兵都是最具威力的兵种之一，在马的帮助下，原本柔弱的步兵成为了具有高度的突击性和机动性的部队，而不幸的是，在中国历史上，除了少数几个王朝外，其军事力量都是以步兵为主的。这就使得他们在面对骑兵时吃了大亏。",
        ]
    },
    {
        "name": "Rhetoric Question",
        "definition": "Use rhetoric question to catch the attention.",
        "examples": [
            "客观的讲，在这样一件事上，就维护元朝的统治而言，主要修的不一定是忠臣，反对修的也未必就是奸臣，其中奥妙何处？要到七年后才会见分晓。",
            "那是因为军队太多，需要动员时间。多少军队需要动员几个月？答：三十万。",
            "让你干，你就不得休息，不让你干，你就不得好死。这似乎是很难理解的，到底是什么使得这一滑稽现象反复发生呢？答案很简单：权力。",
            "相信很多人都会问，他们到底谈了些什么，这个悬疑二十年的谜团的谜底到底是什么？我必须饱含悲痛地告诉大家，我也不知道。",
        ]
    },
    {
        "name": "Slang",
        "definition": "Use slangs to shorten the distance.",
        "examples": [
            "孙德崖的士兵听说主帅被抓，就认定是朱元璋指使的，而此时朱元璋也得到了这个消息，场面极其紧张，朱元璋一看势头不妙，拔马就往回走，士兵早就有准备，铁索往朱元璋的头上一套，下来吧您呐。孙德崖的士兵抓住了朱元璋，就去找郭子兴谈判。",
        ]
    },
    {
        "name": "Summary",
        "definition": "Use a brief summary to stress the point.",
        "examples": [
            "朱元璋，你就是你，历经时间的磨砺，岁月的侵蚀，你还依然屹立在那里，你的丰功伟绩和成败得失都被记录在史册上，供后人评说。江山如画，一时多少豪杰！",
        ]
    },
    {
        "name": "Tricolon",
        "definition": "Use three parallel structures to create emphatic effects.",
        "examples": [
            "更让他烦恼的是，陈友谅在上游，他在下游，让他很不舒服，这种心理其实我们很容易理解，好比你住在山坡下面，他住山坡上面，每次都要抬头看人家，很难受。陈友谅在江里洗脸，朱元璋就要喝他的洗脸水。陈友谅在江里洗脚，朱元璋就要喝他的洗脚水。陈友谅在江里撒尿，朱元璋……",
            "朱元璋要杀朱文正，她劝告朱元璋，朱文正是你的侄子，立有大功，请你不要杀他。朱元璋要杀李文忠，她劝告朱元璋，李文忠是你的外甥，也是你的养子，留他一命吧。朱元璋要杀宋濂，她跪下求朱元璋，宋濂是太子的老师，老百姓尚且尊师，何况帝王家呢。她就是这样用她的慈爱去关怀每一个她认识或是不认识的人，把他们从朱元璋的屠刀下救出来。",
            "朱元璋废除了丞相制度，限制大臣的权力，然而明朝的内阁比以往的任何丞相都更专权。朱元璋规定老百姓不得四处流动，然而明朝中后期流民成风，四处游荡，丝毫不受束缚。朱元璋颁布了抑制商业发展的条令，并规定商人不得穿着绸沙等贵重衣物，然而大规模的工商业发展正是从明朝开始，而那些本应该是社会最底层的商人却穿金戴银，甚至登堂入室，为官经商。朱元璋严令太监不得干政，可是明朝的阉宦却个个都是重量级的",
        ]
    },
    {
        "name": "Variety",
        "definition": "Use a series of statements to create a rich variety of aspects.",
        "examples": [
            "元末是一个名将辈出的时代，在各路诸侯手下都有一大批勇猛的将领，这之中又以朱元璋将领为最强，这些人各有专长，如徐达善谋略，李文忠善奔袭，常遇春善突击，冯胜善侧击，朱文正善防守。但要说到勇猛，天下无出张定边之右！",
        ]
    },
]
