[
    {
        "pattern": "When you...",
        "usage": "\"When you\" presupposes that the person is going to do the thing or experience the state you describe, so it's no longer open to debate or doubt. \"When you feel incredibly loving, do you find yourself compelled to act on it?\""
    },
    {
        "pattern": "What would it be like if...",
        "usage": "This weasel phrase is, in effect, a command for the person to imagine the condition or occurrence named or described after it. \"What would it be like if you were to feel incredibly loving?\""
    },
    {
        "pattern": "A person can...",
        "usage": "By talking about a \"person\" it deflects any resistance on the part of the person, since you really aren't talking about him or her. \"A person can feel incredibly loving, talking with someone they really, really like!\""
    },
    {
        "pattern": "If you were to...",
        "usage": "This is one of my favorite Weasel Phrases! By saying \"if,\" it deflects resistance while directing the person to imagine the experience, condition, feeling or situation you are describing. \"If you were to feel incredibly loving, do you think you might feel compelled to act on it?\" (There's a second command hidden in that last sentence. Can you spot what it is?)"
    },
    {
        "pattern": "As you...",
        "usage": "This phrase assumes the person will do the behavior or undergo the condition you describe. \"As you feel incredibly loving, can you feel how excited you're getting?\""
    },
    {
        "pattern": "It's not necessary to...",
        "usage": "An example of one of my super-weasel patterns, negation, into which we'll get later. By saying it isn't necessary, it eliminates any resistance, since you're saying they don't really have to do it (even though they will!) \"It's not necessary to feel incredibly loving, as you listen carefully to what I say!\""
    },
    {
        "pattern": "You really shouldn't...",
        "usage": "Another negation pattern. Since you're saying they \"shouldn't\", it's not like you're trying to get them to do anything, aren't you? \"You really shouldn't...feel incredibly loving!\"."
    },
    {
        "pattern": "You might find...",
        "usage": "Useful as the start of an intensifying chain of phrases. It implies that they are going to experience what you describe as something that just happens, so it's not like you're commanding them to do it! \"You might find as you feel incredibly loving, it could lead to your acting on it!\""
    },
    {
        "pattern": "To the point where...",
        "usage": "This phrase connects one thing your victim is experiencing with the next thing you want them to experience, so it's useful both as a connector and an amplifier. \"You might find those pictures start to get bigger and brighter to the point where you feel incredibly loving!\""
    },
    {
        "pattern": "Invite you to notice...",
        "usage": "This has the same effect as \"you might find\" because it implies that what you describe is going to happen. Plus, \"invite\" has pleasant connotations of it being voluntary and polite! Ha! Super-manipulation, good buddy! \"And I invite you to notice how the warmth of my voice can allow you to feel incredibly loving!\""
    },
    {
        "pattern": "How surprised would you be to…",
        "usage": "This implies that the event you describe is certainly going to happen, and the only question is how surprised they'll be by it! One of my absolute favorite weasel phrases. An example is: \"How surprised will you be to find that you can feel incredibly loving?\""
    },
]
